Introdução ao Pandas II

In [76]:
# Importando a biblioteca Pandas

import pandas as pd 

# Mapear o caminho e nome do documento

path = 'C:\\Users\\FIC\\Documents\\Luiz Antonio Python\\003 - Arquivos\\'
file = 'bank-full.xlsx'

# Abrindo o documento e atribuindo a um dataframe
df = pd.read_excel(path + file, sheet_name= 'Sheet 1 - bank-full')

# Visualizar 

df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

In [77]:
df['balance'].mean()

1362.2720576850766

In [78]:
media = df['balance'].mean()

# A função round trata valores, ajustando o número de casas decimais
# round(number, number_for_digits)

round(media,0)

1362.0

Calculando a média de mais de uma coluna

In [79]:
# Para selecionar mais de uma coluna . você deve passar uma lista contendo os nomes
#das colunas do dataframe --> Exemplo : dataframe [[lista]]

df[['balance','duration']].mean()

balance     1362.272058
duration     258.163080
dtype: float64

#### Soma (sum)

Quando precisamos saber a soma dos valores de uma determinada variável,
podemos usar a função pd.sum().

In [80]:
df.balance.sum()

61589682

In [81]:
df.duration.sum()

11671811

In [82]:
# É soma de uma lista de variáveis (colunas)

df[['pdays','duration','balance']].sum()

pdays        1817384
duration    11671811
balance     61589682
dtype: int64

### Unique e Nunique

unique- nos mostra todos os valores únicos de uma coluna

nunique- nos mostra a quantidade de elementos únicos em uma coluna

In [83]:
# Comando unique

df.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [84]:
# Comando nunique

df.job.nunique()

12

###  Dados duplicados

A quantidade de elementos duplicados em uma coluna

In [85]:
df.job.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
45206     True
45207     True
45208     True
45209     True
45210     True
Name: job, Length: 45211, dtype: bool

In [86]:
df.job.duplicated().sum()

45199

A quantidade de elementos duplicados em uma tabela

In [87]:
df.duplicated().sum()

0

Identificar os valores duplicados

In [88]:
df.loc[df.duplicated()==True]

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, contact, day, month, duration, campaign, pdays, previous, poutcome]
Index: []

### Remover os dados duplicados
Para criar um novo dataframe sem os dados faltantes ou nulos, utilizamos a função
pd.dropna_duplicated().

In [89]:
df_2 = df.drop_duplicates()

### Dados nulos e faltantes

Dados faltantes ou nulos podem enviesar as análises, por isso é sempre importante
eliminá-los ou substituí-los (de acordo com o contexto de análise).

Uma maneira de saber a quantidade de dados faltantes é utilizando a função pd.isna
ou pd.isnull com a função pd.sum().

In [90]:
# Mostrar quias celulas contém informação nula ou não nula.

df.isnull()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45207,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45208,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45209,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45210,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [91]:
# A quantidade de informações nulas existentes no dataframe  /  De cada coluna

df.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
dtype: int64

#### Excluir informações Nulas ou Faltantes

Para criar um novo dataframe sem os dados faltantes ou nulos, utilizamos a função
pd.dropna().

In [92]:
df_3 = df.dropna()

#### Substituir dados nulos ou faltantes em Dataframe

Quando for necessário substituir os dados faltantes por um novo valor, podemos
usar a função pd.fillna().

In [93]:
df_4 = df.fillna('desconhecido')

df_4.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

## Com o Pandas, temos alguns métodos para unir dados de datasets distintos, dentre
os quais podemos citar:

• concat: função que une os datasets ao longo de um eixo;


• merge: método que combina um ou mais datasets baseado em uma coluna em
comum.

In [94]:
#-------------------------------------------------- Dataframe 01 - Exemplo

dados = {
        'ID': ['1','2','3','4','5'],
        'nome':['Ana','Barbara','Douglas','Lorenzo','Enzo'],
        'sobrenome': ['Silva','Mourão','Souza','Lopes','Mendes']
}

# Converter o dicionário em dataframe
df_1 = pd.DataFrame(dados,columns=['ID','nome','sobrenome'])
 #-------------------------------------------------- Dataframe 02 - Exemplo
dados2 = {
        'ID': ['6','7','8','9','10'],
        'nome':['Eder','Lucas','Joana','Paulo','Bete'],
        'sobrenome': ['Junqueira','Tarrou','Liza','Oshio','Yuho']
}
#-------------------------------------------------- Dataframe 03 - Exemplo
notas = {
        'ID':['1','2','3','4','5','6','7','8','9','10'],
        'notas_id': [51,55,15,61,84,96,100,0,78,12]
}
 #-------------------------------------------------- Dataframe 03 - Exemplo
notas = {
        'ID':['1','2','3','4','5','6','7','8','9','10'],
        'notas_id': [51,55,15,61,84,96,100,0,78,12]
}
df_notas = pd.DataFrame(notas,columns=['ID','notas_id'])

In [95]:
import pandas as pd

In [96]:
df_1.head()

  ID     nome sobrenome
0  1      Ana     Silva
1  2  Barbara    Mourão
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes

In [97]:
df_2.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

In [98]:
df_notas.head()

  ID  notas_id
0  1        51
1  2        55
2  3        15
3  4        61
4  5        84

### Empilhar os dataframes

In [99]:
df_1_2 = pd.concat([df_1,df_2],ignore_index=True)

df_1_2

,ID,nome,sobrenome,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,1,Ana,Silva,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,Barbara,Mourão,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Douglas,Souza,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Lorenzo,Lopes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,Enzo,Mendes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45211,NaN,NaN,NaN,51.0,technician,married,tertiary,no,825.0,no,no,cellular,17.0,nov,977.0,3.0,-1.0,0.0,unknown
45212,NaN,NaN,NaN,71.0,retired,divorced,primary,no,1729.0,no,no,cellular,17.0,nov,456.0,2.0,-1.0,0.0,unknown
45213,NaN,NaN,NaN,72.0,retired,married,secondary,no,5715.0,no,no,cellular,17.0,nov,1127.0,5.0,184.0,3.0,success
45214,NaN,NaN,NaN,57.0,blue-collar,married,secondary,no,668.0,no,no,telephone,17.0,nov,508.0,4.0,-1.0,0.0,unknown
45215,NaN,NaN,NaN,37.0,entrepreneur,married,secondary,no,2971.0,no,no,cellular,17.0,nov,361.0,2.0,188.0,11.0,other

##### Realizar a associação do ID,NOME, Sobrenome e notas(EMERGE)

In [100]:
df_final = pd.merge(df_1_2,df_notas,on='ID',how='left')

df_final

,ID,nome,sobrenome,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,notas_id
0,1,Ana,Silva,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,51.0
1,2,Barbara,Mourão,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,55.0
2,3,Douglas,Souza,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.0
3,4,Lorenzo,Lopes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,61.0
4,5,Enzo,Mendes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,84.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45211,NaN,NaN,NaN,51.0,technician,married,tertiary,no,825.0,no,no,cellular,17.0,nov,977.0,3.0,-1.0,0.0,unknown,NaN
45212,NaN,NaN,NaN,71.0,retired,divorced,primary,no,1729.0,no,no,cellular,17.0,nov,456.0,2.0,-1.0,0.0,unknown,NaN
45213,NaN,NaN,NaN,72.0,retired,married,secondary,no,5715.0,no,no,cellular,17.0,nov,1127.0,5.0,184.0,3.0,success,NaN
45214,NaN,NaN,NaN,57.0,blue-collar,married,secondary,no,668.0,no,no,telephone,17.0,nov,508.0,4.0,-1.0,0.0,unknown,NaN
45215,NaN,NaN,NaN,37.0,entrepreneur,married,secondary,no,2971.0,no,no,cellular,17.0,nov,361.0,2.0,188.0,11.0,other,NaN